//------------------------------------------------------------------------------
// coordinates.cpp - содержит процедуру ввода параметров
// дл€ уже созданных координат
//------------------------------------------------------------------------------

#include "coordinates.h"

//------------------------------------------------------------------------------
// ¬вод параметров координат
void In(coordinates &c, double angle, double value) {
    c.angle = angle;
    c.value = value;
}

//------------------------------------------------------------------------------
// ¬ывод параметров координат в строку
char* Out(coordinates &c) {
    char* outstr = new char[100];
    snprintf(outstr, 99, "Coordinates (%f; %f) - %f", c.angle, c.value, ConvertToReal(c));
    return outstr;
}

//------------------------------------------------------------------------------
// ѕреобразование координат к действительному числу по формуле из услови€
double ConvertToReal(coordinates &c) {
    return c.value;
}
